GopalSaraf/Practicals/PSDL/include/proc/pic18f8680.inc
// Register: B4D7
#define B4D7 B4D7
B4D7                                     equ 0E6Dh
// bitfield definitions
B4D7_B4D70_POSN                          equ 0000h
B4D7_B4D70_POSITION                      equ 0000h
B4D7_B4D70_SIZE                          equ 0001h
B4D7_B4D70_LENGTH                        equ 0001h
B4D7_B4D70_MASK                          equ 0001h
B4D7_B4D71_POSN                          equ 0001h
B4D7_B4D71_POSITION                      equ 0001h
B4D7_B4D71_SIZE                          equ 0001h
B4D7_B4D71_LENGTH                        equ 0001h
B4D7_B4D71_MASK                          equ 0002h
B4D7_B4D72_POSN                          equ 0002h
B4D7_B4D72_POSITION                      equ 0002h
B4D7_B4D72_SIZE                          equ 0001h
B4D7_B4D72_LENGTH                        equ 0001h
B4D7_B4D72_MASK                          equ 0004h
B4D7_B4D73_POSN                          equ 0003h
B4D7_B4D73_POSITION                      equ 0003h
B4D7_B4D73_SIZE                          equ 0001h
B4D7_B4D73_LENGTH                        equ 0001h
B4D7_B4D73_MASK                          equ 0008h
B4D7_B4D74_POSN                          equ 0004h
B4D7_B4D74_POSITION                      equ 0004h
B4D7_B4D74_SIZE                          equ 0001h
B4D7_B4D74_LENGTH                        equ 0001h
B4D7_B4D74_MASK                          equ 0010h
B4D7_B4D75_POSN                          equ 0005h
B4D7_B4D75_POSITION                      equ 0005h
B4D7_B4D75_SIZE                          equ 0001h
B4D7_B4D75_LENGTH                        equ 0001h
B4D7_B4D75_MASK                          equ 0020h
B4D7_B4D76_POSN                          equ 0006h
B4D7_B4D76_POSITION                      equ 0006h
B4D7_B4D76_SIZE                          equ 0001h
B4D7_B4D76_LENGTH                        equ 0001h
B4D7_B4D76_MASK                          equ 0040h
B4D7_B4D77_POSN                          equ 0007h
B4D7_B4D77_POSITION                      equ 0007h
B4D7_B4D77_SIZE                          equ 0001h
B4D7_B4D77_LENGTH                        equ 0001h
B4D7_B4D77_MASK                          equ 0080h
B4D7_B46D77_POSN                         equ 0007h
B4D7_B46D77_POSITION                     equ 0007h
B4D7_B46D77_SIZE                         equ 0001h
B4D7_B46D77_LENGTH                       equ 0001h
B4D7_B46D77_MASK                         equ 0080h

// Register: CANSTAT_RO5
#define CANSTAT_RO5 CANSTAT_RO5
CANSTAT_RO5                              equ 0E6Eh
// bitfield definitions
CANSTAT_RO5_EICODE0_POSN                 equ 0000h
CANSTAT_RO5_EICODE0_POSITION             equ 0000h
CANSTAT_RO5_EICODE0_SIZE                 equ 0001h
CANSTAT_RO5_EICODE0_LENGTH               equ 0001h
CANSTAT_RO5_EICODE0_MASK                 equ 0001h
CANSTAT_RO5_EICODE1_ICODE0_POSN          equ 0001h
CANSTAT_RO5_EICODE1_ICODE0_POSITION      equ 0001h
CANSTAT_RO5_EICODE1_ICODE0_SIZE          equ 0001h
CANSTAT_RO5_EICODE1_ICODE0_LENGTH        equ 0001h
CANSTAT_RO5_EICODE1_ICODE0_MASK          equ 0002h
CANSTAT_RO5_EICODE2_ICODE1_POSN          equ 0002h
CANSTAT_RO5_EICODE2_ICODE1_POSITION      equ 0002h
CANSTAT_RO5_EICODE2_ICODE1_SIZE          equ 0001h
CANSTAT_RO5_EICODE2_ICODE1_LENGTH        equ 0001h
CANSTAT_RO5_EICODE2_ICODE1_MASK          equ 0004h
CANSTAT_RO5_EICODE3_ICODE2_POSN          equ 0003h
CANSTAT_RO5_EICODE3_ICODE2_POSITION      equ 0003h
CANSTAT_RO5_EICODE3_ICODE2_SIZE          equ 0001h
CANSTAT_RO5_EICODE3_ICODE2_LENGTH        equ 0001h
CANSTAT_RO5_EICODE3_ICODE2_MASK          equ 0008h
CANSTAT_RO5_EICODE4_POSN                 equ 0004h
CANSTAT_RO5_EICODE4_POSITION             equ 0004h
CANSTAT_RO5_EICODE4_SIZE                 equ 0001h
CANSTAT_RO5_EICODE4_LENGTH               equ 0001h
CANSTAT_RO5_EICODE4_MASK                 equ 0010h
CANSTAT_RO5_OPMODE0_POSN                 equ 0005h
CANSTAT_RO5_OPMODE0_POSITION             equ 0005h
CANSTAT_RO5_OPMODE0_SIZE                 equ 0001h
CANSTAT_RO5_OPMODE0_LENGTH               equ 0001h
CANSTAT_RO5_OPMODE0_MASK                 equ 0020h
CANSTAT_RO5_OPMODE1_POSN                 equ 0006h
CANSTAT_RO5_OPMODE1_POSITION             equ 0006h
CANSTAT_RO5_OPMODE1_SIZE                 equ 0001h
CANSTAT_RO5_OPMODE1_LENGTH               equ 0001h
CANSTAT_RO5_OPMODE1_MASK                 equ 0040h
CANSTAT_RO5_OPMODE2_POSN                 equ 0007h
CANSTAT_RO5_OPMODE2_POSITION             equ 0007h
CANSTAT_RO5_OPMODE2_SIZE                 equ 0001h
CANSTAT_RO5_OPMODE2_LENGTH               equ 0001h
CANSTAT_RO5_OPMODE2_MASK                 equ 0080h

// Register: CANCON_RO5
#define CANCON_RO5 CANCON_RO5
CANCON_RO5                               equ 0E6Fh
// bitfield definitions
CANCON_RO5_FP0_POSN                      equ 0000h
CANCON_RO5_FP0_POSITION                  equ 0000h
CANCON_RO5_FP0_SIZE                      equ 0001h
CANCON_RO5_FP0_LENGTH                    equ 0001h
CANCON_RO5_FP0_MASK                      equ 0001h
CANCON_RO5_WIN0_FP1_POSN                 equ 0001h
CANCON_RO5_WIN0_FP1_POSITION             equ 0001h
CANCON_RO5_WIN0_FP1_SIZE                 equ 0001h
CANCON_RO5_WIN0_FP1_LENGTH               equ 0001h
CANCON_RO5_WIN0_FP1_MASK                 equ 0002h
CANCON_RO5_WIN1_FP2_POSN                 equ 0002h
CANCON_RO5_WIN1_FP2_POSITION             equ 0002h
CANCON_RO5_WIN1_FP2_SIZE                 equ 0001h
CANCON_RO5_WIN1_FP2_LENGTH               equ 0001h
CANCON_RO5_WIN1_FP2_MASK                 equ 0004h
CANCON_RO5_WIN2_FP3_POSN                 equ 0003h
CANCON_RO5_WIN2_FP3_POSITION             equ 0003h
CANCON_RO5_WIN2_FP3_SIZE                 equ 0001h
CANCON_RO5_WIN2_FP3_LENGTH               equ 0001h
CANCON_RO5_WIN2_FP3_MASK                 equ 0008h
CANCON_RO5_ABAT_POSN                     equ 0004h
CANCON_RO5_ABAT_POSITION                 equ 0004h
CANCON_RO5_ABAT_SIZE                     equ 0001h
CANCON_RO5_ABAT_LENGTH                   equ 0001h
CANCON_RO5_ABAT_MASK                     equ 0010h
CANCON_RO5_REQOP0_POSN                   equ 0005h
CANCON_RO5_REQOP0_POSITION               equ 0005h
CANCON_RO5_REQOP0_SIZE                   equ 0001h
CANCON_RO5_REQOP0_LENGTH                 equ 0001h
CANCON_RO5_REQOP0_MASK                   equ 0020h
CANCON_RO5_REQOP1_POSN                   equ 0006h
CANCON_RO5_REQOP1_POSITION               equ 0006h
CANCON_RO5_REQOP1_SIZE                   equ 0001h
CANCON_RO5_REQOP1_LENGTH                 equ 0001h
CANCON_RO5_REQOP1_MASK                   equ 0040h
CANCON_RO5_REQOP2_POSN                   equ 0007h
CANCON_RO5_REQOP2_POSITION               equ 0007h
CANCON_RO5_REQOP2_SIZE                   equ 0001h
CANCON_RO5_REQOP2_LENGTH                 equ 0001h
CANCON_RO5_REQOP2_MASK                   equ 0080h

// Register: B5CON
#define B5CON B5CON
B5CON                                    equ 0E70h
// bitfield definitions
B5CON_FILHIT0_TXPRI0_POSN                equ 0000h
B5CON_FILHIT0_TXPRI0_POSITION            equ 0000h
B5CON_FILHIT0_TXPRI0_SIZE                equ 0001h
B5CON_FILHIT0_TXPRI0_LENGTH              equ 0001h
B5CON_FILHIT0_TXPRI0_MASK                equ 0001h
B5CON_FILHIT1_TXPRI1_POSN                equ 0001h
B5CON_FILHIT1_TXPRI1_POSITION            equ 0001h
B5CON_FILHIT1_TXPRI1_SIZE                equ 0001h
B5CON_FILHIT1_TXPRI1_LENGTH              equ 0001h
B5CON_FILHIT1_TXPRI1_MASK                equ 0002h
B5CON_FILHIT2_RTREN_POSN                 equ 0002h
B5CON_FILHIT2_RTREN_POSITION             equ 0002h
B5CON_FILHIT2_RTREN_SIZE                 equ 0001h
B5CON_FILHIT2_RTREN_LENGTH               equ 0001h
B5CON_FILHIT2_RTREN_MASK                 equ 0004h
B5CON_FILHIT3_TXREQ_POSN                 equ 0003h
B5CON_FILHIT3_TXREQ_POSITION             equ 0003h
B5CON_FILHIT3_TXREQ_SIZE                 equ 0001h
B5CON_FILHIT3_TXREQ_LENGTH               equ 0001h
B5CON_FILHIT3_TXREQ_MASK                 equ 0008h
B5CON_FILHIT4_TXERR_POSN                 equ 0004h
B5CON_FILHIT4_TXERR_POSITION             equ 0004h
B5CON_FILHIT4_TXERR_SIZE                 equ 0001h
B5CON_FILHIT4_TXERR_LENGTH               equ 0001h
B5CON_FILHIT4_TXERR_MASK                 equ 0010h
B5CON_RTRRO_TXLARB_POSN                  equ 0005h
B5CON_RTRRO_TXLARB_POSITION              equ 0005h
B5CON_RTRRO_TXLARB_SIZE                  equ 0001h
B5CON_RTRRO_TXLARB_LENGTH                equ 0001h
B5CON_RTRRO_TXLARB_MASK                  equ 0020h
B5CON_RXM1_TXABT_POSN                    equ 0006h
B5CON_RXM1_TXABT_POSITION                equ 0006h
B5CON_RXM1_TXABT_SIZE                    equ 0001h
B5CON_RXM1_TXABT_LENGTH                  equ 0001h
B5CON_RXM1_TXABT_MASK                    equ 0040h
B5CON_RXFUL_TXBIF_POSN                   equ 0007h
B5CON_RXFUL_TXBIF_POSITION               equ 0007h
B5CON_RXFUL_TXBIF_SIZE                   equ 0001h
B5CON_RXFUL_TXBIF_LENGTH                 equ 0001h
B5CON_RXFUL_TXBIF_MASK                   equ 0080h
B5CON_FILHIT0_POSN                       equ 0000h
B5CON_FILHIT0_POSITION                   equ 0000h
B5CON_FILHIT0_SIZE                       equ 0001h
B5CON_FILHIT0_LENGTH                     equ 0001h
B5CON_FILHIT0_MASK                       equ 0001h
B5CON_FILHIT1_POSN                       equ 0001h
B5CON_FILHIT1_POSITION                   equ 0001h
B5CON_FILHIT1_SIZE                       equ 0001h
B5CON_FILHIT1_LENGTH                     equ 0001h
B5CON_FILHIT1_MASK                       equ 0002h
B5CON_FILHIT2_POSN                       equ 0002h
B5CON_FILHIT2_POSITION                   equ 0002h
B5CON_FILHIT2_SIZE                       equ 0001h
B5CON_FILHIT2_LENGTH                     equ 0001h
B5CON_FILHIT2_MASK                       equ 0004h
B5CON_FILHIT3_POSN                       equ 0003h
B5CON_FILHIT3_POSITION                   equ 0003h
B5CON_FILHIT3_SIZE                       equ 0001h
B5CON_FILHIT3_LENGTH                     equ 0001h
B5CON_FILHIT3_MASK                       equ 0008h
B5CON_FILHIT4_POSN                       equ 0004h
B5CON_FILHIT4_POSITION                   equ 0004h
B5CON_FILHIT4_SIZE                       equ 0001h
B5CON_FILHIT4_LENGTH                     equ 0001h
B5CON_FILHIT4_MASK                       equ 0010h
B5CON_RTRRO_POSN                         equ 0005h
B5CON_RTRRO_POSITION                     equ 0005h
B5CON_RTRRO_SIZE                         equ 0001h
B5CON_RTRRO_LENGTH                       equ 0001h
B5CON_RTRRO_MASK                         equ 0020h
B5CON_RXM1_POSN                          equ 0006h
B5CON_RXM1_POSITION                      equ 0006h
B5CON_RXM1_SIZE                          equ 0001h
B5CON_RXM1_LENGTH                        equ 0001h
B5CON_RXM1_MASK                          equ 0040h
B5CON_RXFUL_POSN                         equ 0007h
B5CON_RXFUL_POSITION                     equ 0007h
B5CON_RXFUL_SIZE                         equ 0001h
B5CON_RXFUL_LENGTH                       equ 0001h
B5CON_RXFUL_MASK                         equ 0080h
B5CON_TXPRI0_POSN                        equ 0000h
B5CON_TXPRI0_POSITION                    equ 0000h
B5CON_TXPRI0_SIZE                        equ 0001h
B5CON_TXPRI0_LENGTH                      equ 0001h
B5CON_TXPRI0_MASK                        equ 0001h
B5CON_TXPRI1_POSN                        equ 0001h
B5CON_TXPRI1_POSITION                    equ 0001h
B5CON_TXPRI1_SIZE                        equ 0001h
B5CON_TXPRI1_LENGTH                      equ 0001h
B5CON_TXPRI1_MASK                        equ 0002h
B5CON_RTREN_POSN                         equ 0002h
B5CON_RTREN_POSITION                     equ 0002h
B5CON_RTREN_SIZE                         equ 0001h
B5CON_RTREN_LENGTH                       equ 0001h
B5CON_RTREN_MASK                         equ 0004h
B5CON_TXREQ_POSN                         equ 0003h
B5CON_TXREQ_POSITION                     equ 0003h
B5CON_TXREQ_SIZE                         equ 0001h
B5CON_TXREQ_LENGTH                       equ 0001h
B5CON_TXREQ_MASK                         equ 0008h
B5CON_TXERR_POSN                         equ 0004h
B5CON_TXERR_POSITION                     equ 0004h
B5CON_TXERR_SIZE                         equ 0001h
B5CON_TXERR_LENGTH                       equ 0001h
B5CON_TXERR_MASK                         equ 0010h
B5CON_TXLARB_POSN                        equ 0005h
B5CON_TXLARB_POSITION                    equ 0005h
B5CON_TXLARB_SIZE                        equ 0001h
B5CON_TXLARB_LENGTH                      equ 0001h
B5CON_TXLARB_MASK                        equ 0020h
B5CON_TXABT_POSN                         equ 0006h
B5CON_TXABT_POSITION                     equ 0006h
B5CON_TXABT_SIZE                         equ 0001h
B5CON_TXABT_LENGTH                       equ 0001h
B5CON_TXABT_MASK                         equ 0040h
B5CON_TXBIF_POSN                         equ 0007h
B5CON_TXBIF_POSITION                     equ 0007h
B5CON_TXBIF_SIZE                         equ 0001h
B5CON_TXBIF_LENGTH                       equ 0001h
B5CON_TXBIF_MASK                         equ 0080h
B5CON_B5FILHIT0_POSN                     equ 0000h
B5CON_B5FILHIT0_POSITION                 equ 0000h
B5CON_B5FILHIT0_SIZE                     equ 0001h
B5CON_B5FILHIT0_LENGTH                   equ 0001h
B5CON_B5FILHIT0_MASK                     equ 0001h
B5CON_B5FILHIT1_POSN                     equ 0001h
B5CON_B5FILHIT1_POSITION                 equ 0001h
B5CON_B5FILHIT1_SIZE                     equ 0001h
B5CON_B5FILHIT1_LENGTH                   equ 0001h
B5CON_B5FILHIT1_MASK                     equ 0002h
B5CON_B5FILHIT2_POSN                     equ 0002h
B5CON_B5FILHIT2_POSITION                 equ 0002h
B5CON_B5FILHIT2_SIZE                     equ 0001h
B5CON_B5FILHIT2_LENGTH                   equ 0001h
B5CON_B5FILHIT2_MASK                     equ 0004h
B5CON_B5FILHIT3_POSN                     equ 0003h
B5CON_B5FILHIT3_POSITION                 equ 0003h
B5CON_B5FILHIT3_SIZE                     equ 0001h
B5CON_B5FILHIT3_LENGTH                   equ 0001h
B5CON_B5FILHIT3_MASK                     equ 0008h
B5CON_B5FILHIT4_POSN                     equ 0004h
B5CON_B5FILHIT4_POSITION                 equ 0004h
B5CON_B5FILHIT4_SIZE                     equ 0001h
B5CON_B5FILHIT4_LENGTH                   equ 0001h
B5CON_B5FILHIT4_MASK                     equ 0010h
B5CON_B5RTRRO_POSN                       equ 0005h
B5CON_B5RTRRO_POSITION                   equ 0005h
B5CON_B5RTRRO_SIZE                       equ 0001h
B5CON_B5RTRRO_LENGTH                     equ 0001h
B5CON_B5RTRRO_MASK                       equ 0020h
B5CON_B5RXM1_POSN                        equ 0006h
B5CON_B5RXM1_POSITION                    equ 0006h
B5CON_B5RXM1_SIZE                        equ 0001h
B5CON_B5RXM1_LENGTH                      equ 0001h
B5CON_B5RXM1_MASK                        equ 0040h
B5CON_B5RXFUL_POSN                       equ 0007h
B5CON_B5RXFUL_POSITION                   equ 0007h
B5CON_B5RXFUL_SIZE                       equ 0001h
B5CON_B5RXFUL_LENGTH                     equ 0001h
B5CON_B5RXFUL_MASK                       equ 0080h
B5CON_B5TXPRI0_POSN                      equ 0000h
B5CON_B5TXPRI0_POSITION                  equ 0000h
B5CON_B5TXPRI0_SIZE                      equ 0001h
B5CON_B5TXPRI0_LENGTH                    equ 0001h
B5CON_B5TXPRI0_MASK                      equ 0001h
B5CON_B5TXPRI1_POSN                      equ 0001h
B5CON_B5TXPRI1_POSITION                  equ 0001h
B5CON_B5TXPRI1_SIZE                      equ 0001h
B5CON_B5TXPRI1_LENGTH                    equ 0001h
B5CON_B5TXPRI1_MASK                      equ 0002h
B5CON_B5RTREN_POSN                       equ 0002h
B5CON_B5RTREN_POSITION                   equ 0002h
B5CON_B5RTREN_SIZE                       equ 0001h
B5CON_B5RTREN_LENGTH                     equ 0001h
B5CON_B5RTREN_MASK                       equ 0004h
B5CON_B5TXREQ_POSN                       equ 0003h
B5CON_B5TXREQ_POSITION                   equ 0003h
B5CON_B5TXREQ_SIZE                       equ 0001h
B5CON_B5TXREQ_LENGTH                     equ 0001h
B5CON_B5TXREQ_MASK                       equ 0008h
B5CON_B5TXERR_POSN                       equ 0004h
B5CON_B5TXERR_POSITION                   equ 0004h
B5CON_B5TXERR_SIZE                       equ 0001h
B5CON_B5TXERR_LENGTH                     equ 0001h
B5CON_B5TXERR_MASK                       equ 0010h
B5CON_B5TXLARB_POSN                      equ 0005h
B5CON_B5TXLARB_POSITION                  equ 0005h
B5CON_B5TXLARB_SIZE                      equ 0001h
B5CON_B5TXLARB_LENGTH                    equ 0001h
B5CON_B5TXLARB_MASK                      equ 0020h
B5CON_B5TXABT_POSN                       equ 0006h
B5CON_B5TXABT_POSITION                   equ 0006h
B5CON_B5TXABT_SIZE                       equ 0001h
B5CON_B5TXABT_LENGTH                     equ 0001h
B5CON_B5TXABT_MASK                       equ 0040h
B5CON_B5TXBIF_POSN                       equ 0007h
B5CON_B5TXBIF_POSITION                   equ 0007h
B5CON_B5TXBIF_SIZE                       equ 0001h
B5CON_B5TXBIF_LENGTH                     equ 0001h
B5CON_B5TXBIF_MASK                       equ 0080h

// Register: B5SIDH
#define B5SIDH B5SIDH
B5SIDH                                   equ 0E71h
// bitfield definitions
B5SIDH_SID3_POSN                         equ 0000h
B5SIDH_SID3_POSITION                     equ 0000h
B5SIDH_SID3_SIZE                         equ 0001h
B5SIDH_SID3_LENGTH                       equ 0001h
B5SIDH_SID3_MASK                         equ 0001h
B5SIDH_SID4_POSN                         equ 0001h
B5SIDH_SID4_POSITION                     equ 0001h
B5SIDH_SID4_SIZE                         equ 0001h
B5SIDH_SID4_LENGTH                       equ 0001h
B5SIDH_SID4_MASK                         equ 0002h
B5SIDH_SID5_POSN                         equ 0002h
B5SIDH_SID5_POSITION                     equ 0002h
B5SIDH_SID5_SIZE                         equ 0001h
B5SIDH_SID5_LENGTH                       equ 0001h
B5SIDH_SID5_MASK                         equ 0004h
B5SIDH_SID6_POSN                         equ 0003h
B5SIDH_SID6_POSITION                     equ 0003h
B5SIDH_SID6_SIZE                         equ 0001h
B5SIDH_SID6_LENGTH                       equ 0001h
B5SIDH_SID6_MASK                         equ 0008h
B5SIDH_SID7_POSN                         equ 0004h
B5SIDH_SID7_POSITION                     equ 0004h
B5SIDH_SID7_SIZE                         equ 0001h
B5SIDH_SID7_LENGTH                       equ 0001h
B5SIDH_SID7_MASK                         equ 0010h
B5SIDH_SID8_POSN                         equ 0005h
B5SIDH_SID8_POSITION                     equ 0005h
B5SIDH_SID8_SIZE                         equ 0001h
B5SIDH_SID8_LENGTH                       equ 0001h
B5SIDH_SID8_MASK                         equ 0020h
B5SIDH_SID9_POSN                         equ 0006h
B5SIDH_SID9_POSITION                     equ 0006h
B5SIDH_SID9_SIZE                         equ 0001h
B5SIDH_SID9_LENGTH                       equ 0001h
B5SIDH_SID9_MASK                         equ 0040h
B5SIDH_SID10_POSN                        equ 0007h
B5SIDH_SID10_POSITION                    equ 0007h
B5SIDH_SID10_SIZE                        equ 0001h
B5SIDH_SID10_LENGTH                      equ 0001h
B5SIDH_SID10_MASK                        equ 0080h
B5SIDH_B5SID3_POSN                       equ 0000h
B5SIDH_B5SID3_POSITION                   equ 0000h
B5SIDH_B5SID3_SIZE                       equ 0001h
B5SIDH_B5SID3_LENGTH                     equ 0001h
B5SIDH_B5SID3_MASK                       equ 0001h
B5SIDH_B5SID4_POSN                       equ 0001h
B5SIDH_B5SID4_POSITION                   equ 0001h
B5SIDH_B5SID4_SIZE                       equ 0001h
B5SIDH_B5SID4_LENGTH                     equ 0001h
B5SIDH_B5SID4_MASK                       equ 0002h
B5SIDH_B5SID5_POSN                       equ 0002h
B5SIDH_B5SID5_POSITION                   equ 0002h
B5SIDH_B5SID5_SIZE                       equ 0001h
B5SIDH_B5SID5_LENGTH                     equ 0001h
B5SIDH_B5SID5_MASK                       equ 0004h
B5SIDH_B5SID6_POSN                       equ 0003h
B5SIDH_B5SID6_POSITION                   equ 0003h
B5SIDH_B5SID6_SIZE                       equ 0001h
B5SIDH_B5SID6_LENGTH                     equ 0001h
B5SIDH_B5SID6_MASK                       equ 0008h
B5SIDH_B5SID7_POSN                       equ 0004h
B5SIDH_B5SID7_POSITION                   equ 0004h
B5SIDH_B5SID7_SIZE                       equ 0001h
B5SIDH_B5SID7_LENGTH                     equ 0001h
B5SIDH_B5SID7_MASK                       equ 0010h
B5SIDH_B5SID8_POSN                       equ 0005h
B5SIDH_B5SID8_POSITION                   equ 0005h
B5SIDH_B5SID8_SIZE                       equ 0001h
B5SIDH_B5SID8_LENGTH                     equ 0001h
B5SIDH_B5SID8_MASK                       equ 0020h
B5SIDH_B5SID9_POSN                       equ 0006h
B5SIDH_B5SID9_POSITION                   equ 0006h
B5SIDH_B5SID9_SIZE                       equ 0001h
B5SIDH_B5SID9_LENGTH                     equ 0001h
B5SIDH_B5SID9_MASK                       equ 0040h
B5SIDH_B5SID10_POSN                      equ 0007h
B5SIDH_B5SID10_POSITION                  equ 0007h
B5SIDH_B5SID10_SIZE                      equ 0001h
B5SIDH_B5SID10_LENGTH                    equ 0001h
B5SIDH_B5SID10_MASK                      equ 0080h

